In [47]:
import pandas as pd

df = pd.read_csv('/Users/irasamant/Documents/ITSC 3162/Project-3--Car-Price-Prediction-/Cars_datasets_ 2025.csv', encoding_errors='replace')

In [48]:


# 2) Rename multiple columns at once (provide a dict of mappings)
df = df.rename(columns={'cars_prices': 'Total Price (USD)', 'horsepower': 'Horsepower(hp)','total_speed':'Speed(km/h)','torque':'torque(Nm)'})

# 3) Rename by assignment (replace all column names)
# Make sure the list length matches the number of columns
# df.columns = ['col1', 'col2', 'col3', ...]

# 4) Bulk rename using string operations (e.g., lowercase, remove spaces)


# Show new columns and head
print(df.columns)
df.head()

Index(['Company Names', 'Cars Names', 'Engines', 'CC/Battery Capacity',
       'HorsePower', 'Total Speed', 'Performance(0 - 100 )KM/H', 'Cars Prices',
       'Fuel Types', 'Seats', 'Torque'],
      dtype='object')

,Company Names,Cars Names,Engines,CC/Battery Capacity,HorsePower,Total Speed,Performance(0 - 100 )KM/H,Cars Prices,Fuel Types,Seats,Torque
0,FERRARI,SF90 STRADALE,V8,3990 cc,963 hp,340 km/h,2.5 sec,"$1,100,000",plug in hyrbrid,2,800 Nm
1,ROLLS ROYCE,PHANTOM,V12,6749 cc,563 hp,250 km/h,5.3 sec,"$460,000",Petrol,5,900 Nm
2,Ford,KA+,1.2L Petrol,"1,200 cc",70-85 hp,165 km/h,10.5 sec,"$12,000-$15,000",Petrol,5,100 - 140 Nm
3,MERCEDES,GT 63 S,V8,"3,982 cc",630 hp,250 km/h,3.2 sec,"$161,000",Petrol,4,900 Nm
4,AUDI,AUDI R8 Gt,V10,"5,204 cc",602 hp,320 km/h,3.6 sec,"$253,290",Petrol,2,560 Nm

In [49]:
df.shape

(1218, 11)

In [50]:
df.dtypes

Company Names                object
Cars Names                   object
Engines                      object
CC/Battery Capacity          object
HorsePower                   object
Total Speed                  object
Performance(0 - 100 )KM/H    object
Cars Prices                  object
Fuel Types                   object
Seats                        object
Torque                       object
dtype: object

In [51]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1218 entries, 0 to 1217
Data columns (total 11 columns):
 #   Column                     Non-Null Count  Dtype
---  ------                     --------------  -----
 0   Company Names              1218 non-null   object
 1   Cars Names                 1218 non-null   object
 2   Engines                    1218 non-null   object
 3   CC/Battery Capacity        1215 non-null   object
 4   HorsePower                 1218 non-null   object
 5   Total Speed                1218 non-null   object
 6   Performance(0 - 100 )KM/H  1212 non-null   object
 7   Cars Prices                1218 non-null   object
 8   Fuel Types                 1218 non-null   object
 9   Seats                      1218 non-null   object
 10  Torque                     1217 non-null   object
dtypes: object(11)
memory usage: 104.8+ KB

In [52]:
df.isnull().sum()

Company Names                0
Cars Names                   0
Engines                      0
CC/Battery Capacity          3
HorsePower                   0
Total Speed                  0
Performance(0 - 100 )KM/H    6
Cars Prices                  0
Fuel Types                   0
Seats                        0
Torque                       1
dtype: int64

In [53]:
df.describe()

,Company Names,Cars Names,Engines,CC/Battery Capacity,HorsePower,Total Speed,Performance(0 - 100 )KM/H,Cars Prices,Fuel Types,Seats,Torque
count,1218,1218,1218,1215,1218,1218,1212,1218,1218,1218,1217
unique,37,1201,356,311,456,114,180,535,23,19,263
top,Nissan,Macan T,I4,"2,000 cc",355 hp,250 km/h,6.5 sec,"$35,000",Petrol,5,400 Nm
freq,149,2,64,31,23,145,45,36,871,692,72

In [54]:
df.duplicated().sum()

4

In [55]:
# Clean price column: handle single values like '$12,000' and ranges like '$12,000-$15,000'
# Replace 'Cars Prices' below with the actual column name if different
price_col = 'Cars Prices'
import re

def parse_price(val):
    if pd.isna(val):
        return pd.NA
    s = str(val).strip()
    # Remove spaces
    s = s.replace(' ', '')
    # If range like '12000-15000' or '$12,000-$15,000'
    if '-' in s:
        parts = s.split('-')
        nums = []
        for p in parts:
            p_clean = re.sub(r'\$|,', '', p)
            try:
                nums.append(float(p_clean))
            except:
                pass
        if len(nums) == 0:
            return pd.NA
        return sum(nums)/len(nums)
    # Single value: remove $ and commas
    s_clean = re.sub(r'\$|,', '', s)
    try:
        return float(s_clean)
    except:
        return pd.NA

if price_col in df.columns:
    # Apply parser, then convert to nullable integer
    df[price_col] = df[price_col].apply(parse_price)
    df[price_col] = pd.to_numeric(df[price_col], errors='coerce').round(0).astype('Int64')
    print(f'Converted column to', df[price_col].dtype)
else:
    print(f'Column {price_col!r} not found in dataframe. Available columns: {list(df.columns)}')

# Show results
df[[price_col]].head() if price_col in df.columns else df.head()

Converted column to Int64

   Cars Prices
0      1100000
1       460000
2        13500
3       161000
4       253290

In [56]:
df.head()

,Company Names,Cars Names,Engines,CC/Battery Capacity,HorsePower,Total Speed,Performance(0 - 100 )KM/H,Cars Prices,Fuel Types,Seats,Torque
0,FERRARI,SF90 STRADALE,V8,3990 cc,963 hp,340 km/h,2.5 sec,1100000,plug in hyrbrid,2,800 Nm
1,ROLLS ROYCE,PHANTOM,V12,6749 cc,563 hp,250 km/h,5.3 sec,460000,Petrol,5,900 Nm
2,Ford,KA+,1.2L Petrol,"1,200 cc",70-85 hp,165 km/h,10.5 sec,13500,Petrol,5,100 - 140 Nm
3,MERCEDES,GT 63 S,V8,"3,982 cc",630 hp,250 km/h,3.2 sec,161000,Petrol,4,900 Nm
4,AUDI,AUDI R8 Gt,V10,"5,204 cc",602 hp,320 km/h,3.6 sec,253290,Petrol,2,560 Nm